Revit 2027 API
SpatialElementTag.TagOrientation Property
 The orientation of the tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementTagOrientation TagOrientation { get; set; }
Public Property TagOrientation As SpatialElementTagOrientation
	Get
	Set
public:
property SpatialElementTagOrientation TagOrientation {
	SpatialElementTagOrientation get ();
	void set (SpatialElementTagOrientation value);
}
member TagOrientation : SpatialElementTagOrientation with get, set
Property Value
SpatialElementTagOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 See [!:Autodesk::Revit::DB::getSpatialElementTagOrientation] for the supported orientations.
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace